# What I learned in week1

### 기초 백엔드 스터디 OT ###

- **스터디 진행 시간과 준비물**

	기초 백엔드 스터디는 매주 화요일 오후 6시에 진행됩니다.
	
	출석 체크와 실습을 위해 노트북을 반드시 지참해야 합니다.

- **스터디 내용**

	기초 백엔드 스터디에선 웹 개발 프레임워크 Django에 대해 배웁니다.
	
	간단한 게시판을 직접 만들어보는 커리큘럼입니다.
	
- **스터디 과제**
	
	스터디 과제는 두 가지로 나눠집니다.
	
	1. 게시판 만들기 실습 과제
	2. 강의 요약 과제
---
### 웹 기초 지식 ###

- **인터넷이란?**

	전 세계 컴퓨터를 유선으로 연결해놓은 네트워크

- **프로토콜이란?**

	컴퓨터나 원거리 통신시 메세지를 주고 받기 위해 미리 해놓은 약속, 양식
	
- **웹이란?**

	HTML을 이용해 웹사이트를 작성하고,
	URL을 이용해 주소를 지정해,
	HTTP 방식으로 통신하는 통신 방법
	
- **URl의 구조**

	"http://domain:80/path/myHtml.html?queryParam=value"
	
	프로토콜://도메인:포트/경로/쿼리파라미터
-----
